sascha8a/cits-to-go/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c5"
CONFIG_IDF_TARGET_ESP32C5=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHMODE="dio"
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL=2
CONFIG_LOG_DEFAULT_LEVEL_NONE=y
CONFIG_LOG_DEFAULT_LEVEL=0
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_CITS_SERIAL_OUTPUT_USB_AND_SPI=y
CONFIG_CITS_SPI_CLOCK_HZ=4000000
CONFIG_CITS_SPI_CS_GPIO=0
CONFIG_CITS_SPI_READY_GPIO=25
CONFIG_CITS_SPI_MOSI_GPIO=7
CONFIG_CITS_SPI_MISO_GPIO=23
CONFIG_CITS_SPI_CLK_GPIO=24
CONFIG_CITS_SPI_READY_TIMEOUT_MS=100
